backend/app/controllers/api/v1/categories_controller.rb

    def index
        render json: Category.all, include: :playlists
---
SELECT "categories".* FROM "categories"
SELECT "playlists".* FROM "playlists" WHERE "playlists"."category_id" = $1  [["category_id", 4]]

    def show
        category = Category.find(params[:id])
        serialized_category = {
            name: category.name,
            user_id: category.user_id,
            playlists: category.playlists.map do |p|
                {
                id: p.id,
                title: p.title,
                songs: p.songs,
                created_by: User.find(p.user_id).username,
                category: Category.find(p.category_id).name,
                likes: p.likes.length
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."category_id" = $1  [["category_id", 12]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]