backend/app/controllers/api/v1/likes_controller.rb

    def create
        # if user has not liked this playlist
        like = Playlist.find(params[:playlist_id]).likes.find {|like| like.user_id == @user.id }
        if !like
            Like.create(user_id: @user.id, playlist_id: params[:playlist_id])
            render json: {"message": "liked playlist"}
        else
            like.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."playlist_id" = $1  [["playlist_id", 10]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "playlist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 13], ["playlist_id", 10], ["created_at", "2020-07-09 03:11:03.701648"], ["updated_at", "2020-07-09 03:11:03.701648"]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 37]]