backend/app/controllers/api/v1/playlists_controller.rb

    def index
        playlists = Playlist.all
        serialized_playlist = playlists.map do |p|
          {
            id: p.id,
            title: p.title,
            songs: p.songs,
            created_by: User.find(p.user_id).username,
            category: Category.find(p.category_id).name,
            likes: p.likes.length
---
SELECT "playlists".* FROM "playlists"
SELECT "songs".* FROM "songs" WHERE "songs"."playlist_id" = $1  [["playlist_id", 10]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."playlist_id" = $1  [["playlist_id", 10]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

    def create
        playlist_created = Playlist.create(
            title: params[:title],
            user_id: @user.id,
            category_id: params[:category_id]
        )
---
INSERT INTO "playlists" ("title", "user_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Space Jamz"], ["user_id", 12], ["category_id", 17], ["created_at", "2020-07-09 00:33:27.991895"], ["updated_at", "2020-07-09 00:33:27.991895"]]

    def destroy
        playlist_to_delete = Playlist.find(params[:id])
        if playlist_to_delete.user_id == @user.id
            playlist_to_delete.destroy
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
DELETE FROM "playlists" WHERE "playlists"."id" = $1  [["id", 41]]

    def update
        playlist_to_update = Playlist.find(params[:id])
        if playlist_to_update.user_id == @user.id
            playlist_to_update.update(
              title: params[:title],
              # category_id: params[:category_id],
              user_id: @user.id
            )
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
UPDATE "playlists" SET "title" = $1, "updated_at" = $2 WHERE "playlists"."id" = $3  [["title", "Space Jamz 90s"], ["updated_at", "2020-07-09 03:12:45.899920"], ["id", 40]]