backend/app/controllers/api/v1/songs_controller.rb

    def create
        playlist = Playlist.find(params[:playlist_id])
        if playlist.user_id === @user.id
            song_created = Song.create(
                name: params[:name],
                artist: params[:artist],
                genre: "Pop",
                video_id: params[:video_id],
                playlist_id: params[:playlist_id]
            )
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
INSERT INTO "songs" ("name", "artist", "genre", "video_id", "playlist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def destroy
        song_to_delete = Song.find(params[:id])
        playlist = Playlist.find(song_to_delete.playlist_id)
        if playlist.user_id == @user.id
            song_to_delete.destroy
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 323], ["LIMIT", 1]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 323]]