backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    user = User.new(user_params)

    if user.valid?
      user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = $1  [["user_id", 12]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
  def show
    user = User.find(params[:id])
    serialized_playlists = user.playlists.map do |p|
      {
        id: p.id,
        title: p.title,
        songs: p.songs,
        created_by: User.find(p.user_id).username,
        category: Category.find(p.category_id).name,
        likes: p.likes.length